#+TITLE: Using struct to structure related data

* Defining and instantiating structs
#+begin_src rust
struct User {
    username: String,
    email: String,
    sign_in_count: u64,
    active: bool,
}

let mut user1 = ser {
    email: String::from("someone@example.com"),
    username: String::from("someusername123"),
    active: true,
    sign_in_count: 1,
};

user1.email = String::from("anotheremail@example.com");
#+end_src

#+RESULTS:
: error: Could not compile `cargoxhilpg`.

** Refactoring with structs
#+begin_src rust
struct Rectangle {
    width: u32,
    height: u32,
}

// & indicates a borrow rather than taking ownership
fn area(rect: &Rectangle) -> u32 {
    rect.width * rect.height
}

fn main() {
    let rect1 = Rectangle {
        width: 30,
        height: 50,
    };

    println!("the area of the rect is {}", area(&rect1));
}
#+end_src

#+RESULTS:
: the area of the rect is 1500

** Adding useful functionality with derived traits
+ it would be nice if we could print a string representation of the struct...
+ in format strings, we can use ~{:?}~ or ~{:#?}~ to tell ~println!~ that we want to use an output format called ~Debug~
+ the ~Debug~ trait enables us to print a str repres of our struct
#+begin_src rust
#[derive(Debug)]
struct Rectangle {
    width: u32,
    height: u32,
}

fn area(rect: &Rectangle) -> u32 {
    rect.width * rect.height
}

fn main() {
    let rect1 = Rectangle {
        width: 30,
        height: 50,
    };

    println!("the rect {:#?}\nhas area {}", rect1, area(&rect1));
}
#+end_src

#+RESULTS:
: the rect Rectangle {
:     width: 30,
:     height: 50,
: }
: has area 1500

